In [31]:
import pandas as pd
import random

In [138]:
df = pd.read_excel('tb.xlsx', sheet_name=None)

In [139]:
df.keys()

odict_keys(['tb_balances', 'tb_desc', 'fs_groupings'])

In [140]:
df_bal = df['tb_balances'].copy()
df_desc = df['tb_desc'].copy()
df_group = df['fs_groupings'].copy()

In [158]:
df_group.head(2)

   Account Financial Statement Grouping
0     1000    Cash and cash equivalents
1     1010    Cash and cash equivalents

In [159]:
df_bal.head(2)

,Account,Balance,Description,FS Group
0,1000,79256,Petty Cash,Cash and cash equivalents
1,1010,24498,Cash on Hand (e.g. in cash registers),Cash and cash equivalents

In [160]:
df_desc.head(2)

   Account                            Description
0     1000                             Petty Cash
1     1010  Cash on Hand (e.g. in cash registers)

In [144]:
df_desc_dict = dict(zip(df_desc['Account'], df_desc['Description']))

In [145]:
df_desc_dict[1010]

'Cash on Hand (e.g. in cash registers)'

In [146]:
def lookup_desc(act):
    return df_desc_dict.get(act, 'ERROR: Acct not found')

In [147]:
lookup_desc(1000)

'Petty Cash'

In [161]:
df_bal['Description'] = df_bal['Account'].map(lookup_desc)
df_bal.head(2)

,Account,Balance,Description,FS Group
0,1000,79256,Petty Cash,Cash and cash equivalents
1,1010,24498,Cash on Hand (e.g. in cash registers),Cash and cash equivalents

In [149]:
df_group_dict = dict(zip(df_desc['Account'], df_group['Financial Statement Grouping']))

In [150]:
def lookup_group(act):
    return df_group_dict.get(act, 'ERROR: Grouping not found')

In [151]:
lookup_group(1000)

'Cash and cash equivalents'

In [152]:
df_bal['FS Group'] = df_bal['Account'].map(lookup_group)

In [162]:
df_bal.head(2)

,Account,Balance,Description,FS Group
0,1000,79256,Petty Cash,Cash and cash equivalents
1,1010,24498,Cash on Hand (e.g. in cash registers),Cash and cash equivalents

In [163]:
df_bal.pivot_table(index='FS Group', values='Balance', aggfunc=sum).head(2)

                          Balance
FS Group
Accounts payable            40897
Accounts receivable, net    81124